In [23]:
import pandas as pd

In [24]:
df = pd.DataFrame([[1, 2], [3, 4], [5, 6]], columns=['x', 'y',], index=['a', 'b', 'c'])

In [25]:
df

   x  y
a  1  2
b  3  4
c  5  6

In [26]:
df.head()

   x  y
a  1  2
b  3  4
c  5  6

In [27]:
df.tail()

   x  y
a  1  2
b  3  4
c  5  6

In [28]:
df

   x  y
a  1  2
b  3  4
c  5  6

In [29]:
df.head(1)

   x  y
a  1  2

In [30]:
df.tail(1)

   x  y
c  5  6

In [31]:
coffee = pd.read_csv('warmup-data/coffee.csv')

In [32]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [33]:
results = pd.read_parquet('data/results.parquet')

In [34]:
results.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,17.0,True,None
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,None
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,32.0,True,None
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,None
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,None

In [35]:
coffee.sort_values('Units Sold', ascending=False)

          Day Coffee Type  Units Sold
10   Saturday    Espresso          45
8      Friday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
11   Saturday       Latte          35
13     Sunday       Latte          35
9      Friday       Latte          35
2     Tuesday    Espresso          30
7    Thursday       Latte          30
0      Monday    Espresso          25
5   Wednesday       Latte          25
3     Tuesday       Latte          20
1      Monday       Latte          15

In [36]:
bios = pd.read_csv('data/bios.csv')

In [37]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [38]:
bios

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25
...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20

In [39]:
bios.loc[bios['born_country'] == 'PAK', ['name', 'born_city']]

                         name   born_city
288            Mohammed Sleem      Multan
1046              Farjad Saif     Karachi
3991               Boy Murphy      Murree
4800              Javid Aslam  Faisalabad
4880                 Asif Dar      Quetta
...                       ...         ...
128770          Najma Parveen  Faisalabad
128771          Minhal Sohail     Karachi
132543            Mehboob Ali       Kasur
132545  Ghulam Mustafa Bashir       Okara
142245            Talha Talib  Gujranwala

[187 rows x 2 columns]

In [40]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [41]:
bios.loc[bios['name'].str.contains('saqlain|zain' , case=False)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
5275,5294,Zaina Kapepula,1975-08-14,Lubumbashi,Haut-Katanga,COD,Democratic Republic of the Congo,180.0,73.0,NaN
12794,12864,Jean-Yves Touzaint,1948-10-08,NaN,NaN,NaN,France,168.0,63.0,NaN
12795,12865,Thierry Touzaint,1953-12-26,Granville,Manche,FRA,France,174.0,72.0,NaN
16297,16412,Safarrudin Zain,1938-03-22,George Town,Pulau Pinang,MAS,Malaysia,166.0,66.0,2023-06-20
19419,19558,Khair-ud-Din bin Zainal,1946-11-21,NaN,NaN,NaN,Malaysia,169.0,64.0,NaN
19459,19598,Azaari Mohamed Zain,1952-12-11,NaN,NaN,NaN,Malaysia,173.0,64.0,NaN
19467,19606,Nor Saiful Zaini Nasir-ud-Din,1966-03-27,NaN,NaN,NaN,Malaysia,170.0,74.0,NaN
29765,29990,Georges Mauvezain,1878-02-27,Paris Xe,Paris,FRA,France,159.0,NaN,1943-09-19
50577,50936,Ana Carolina Itzaina,1979-05-14,NaN,NaN,NaN,Uruguay,NaN,NaN,NaN
72835,73389,Zain-ud-Din bin Abdul Wahab,1948-05-14,Labuan,Labuan,MAS,Malaysia,170.0,59.0,2022-06-07
89968,90688,Nicolas Touzaint,1980-05-10,Angers,Maine-et-Loire,FRA,France,174.0,60.0,NaN
112653,113931,Muhammad Saqlain,1978-02-23,Lahore,Punjab,PAK,Pakistan,178.0,64.0,NaN
118383,120093,Zain Shaito,1990-10-19,Dallas,Texas,USA,Lebanon,185.0,72.0,NaN
121398,123383,Salma Zain,1990-04-14,Al-Iskanderiya (Alexandria),Al-Iskanderiya,EGY,Egypt,170.0,60.0,NaN

In [42]:
bios.loc[bios['name'].str.contains('saqlain', case=False), 'NOC'] = 'ITA'

In [43]:
bios.loc[bios['name'].str.contains('saqlain' , case=False)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
112653,113931,Muhammad Saqlain,1978-02-23,Lahore,Punjab,PAK,ITA,178.0,64.0,NaN

In [44]:
bios.loc[bios['name'].str.contains('khalid' , case=False)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
4018,4032,Khalid Al-Karkhi,1940-08-15,Baghdad,Baghdad,IRQ,Iraq,165.0,63.0,NaN
4493,4508,Khalid Rahilou,1966-06-19,NaN,NaN,NaN,Morocco,172.0,63.0,NaN
16440,16556,Khalid Shebani,NaN,NaN,NaN,NaN,Libya,167.0,67.0,NaN
19853,19993,Khalid Bashir,1968-02-14,Faisalabad,Punjab,PAK,Pakistan,177.0,65.0,NaN
19854,19994,Khalid Hamid,1962-11-18,Gujranwala,Punjab,PAK,Pakistan,169.0,65.0,NaN
19855,19995,Khalid Mahmood,1941-12-28,Jhelum,Punjab,PAK,Pakistan,175.0,71.0,NaN
19856,19996,Muhammad Khalid,1973-03-18,NaN,NaN,NaN,Pakistan,NaN,NaN,NaN
19884,20024,Khalid Mahmood,1969-03-10,NaN,NaN,NaN,Pakistan,NaN,NaN,NaN
21213,21361,Abdul Rahman Khalid,1966-01-17,NaN,NaN,NaN,Bahrain,180.0,69.0,NaN
24559,24748,Khalid Gadallah,1958-10-24,Al-Qahira (Cairo),Al-Qahira,EGY,Egypt,NaN,NaN,NaN
26252,26445,Khalid El-Bied,1955-08-24,Rabat,Rabat-Salé-Kénitra,MAR,Morocco,167.0,68.0,NaN
26285,26478,Khalid Raghib,1969-09-22,Settat,Casablanca-Settat,MAR,Morocco,180.0,70.0,NaN
71084,71618,Khalid Tawfik Lazim,1944-03-09,NaN,NaN,NaN,Iraq,NaN,NaN,NaN
72448,72998,Khaled Al-Khalidi,1965-02-14,NaN,NaN,NaN,Kingdom of Saudi Arabia,195.0,110.0,NaN
72759,73312,Khalid Boulami,1969-08-07,Safi,Marrakesh-Safi,MAR,Morocco,167.0,60.0,NaN
72792,73346,Khalid Skah,1967-01-29,Midelt,Drâa-Tafilalet,MAR,Morocco,170.0,60.0,NaN
73808,74376,Abdullah Salem Al-Khalidi,1958-03-01,NaN,NaN,NaN,Oman,170.0,66.0,NaN
78743,79334,Khalid Al-Estashi,1974-03-19,NaN,NaN,NaN,Yemen,155.0,65.0,NaN
87568,88266,Khalid Tighazouine,1977-06-18,Ouarzazate,Drâa-Tafilalet,MAR,Morocco,175.0,68.0,NaN
92945,93691,Khalid Al-Kulaibi,1986-05-02,NaN,NaN,NaN,Oman,170.0,63.0,NaN
102867,103828,Khalid Habash Al-Suwaidi,1984-10-10,NaN,NaN,NaN,Qatar,188.0,105.0,NaN
103769,104762,Khalid Mohamed,1976-01-01,NaN,NaN,NaN,Bahrain,178.0,68.0,NaN
106422,107521,Khalid Al-Harbi,1975-07-10,NaN,NaN,NaN,Kingdom of Saudi Arabia,175.0,73.0,NaN
107154,108276,Khalid El-Boumlili,1978-04-10,Meknès,Fès-Meknès,MAR,Morocco,170.0,61.0,NaN
111737,112982,Khalid Yafai,1989-06-11,Birmingham,England,GBR,Great Britain,162.0,51.0,NaN
114568,115880,Khalid Rushaka,1980-04-26,NaN,NaN,NaN,United Republic of Tanzania,186.0,87.0,NaN
116794,118207,Khalid Al-Hamadi,1987-10-27,Ad-Dawhah (Doha),Ad-Dawhah,QAT,Qatar,171.0,57.0,NaN
118499,120220,Khalid Baba,1996-09-06,Al-Manamah,Al-Asimah,BRN,Bahrain,165.0,60.0,NaN
122450,124546,Khalid Isa,1989-09-15,Al Ain,Abu Dhabi,UAE,United Arab Emirates,178.0,74.0,NaN
123232,125406,Noraseela Mohd Khalid,1979-09-27,George Town,Pulau Pinang,MAS,Malaysia,166.0,55.0,NaN
130847,133596,Khalid Assar,1992-12-10,Desouk,Kafr As-Sayh,EGY,Egypt,198.0,99.0,NaN
132230,135080,Khalid El-Aabidi,1995-09-14,NaN,NaN,NaN,Morocco,178.0,85.0,NaN
138854,142282,Salma Khalid,2003-12-19,Al-Qahira (Cairo),Al-Qahira,EGY,Egypt,NaN,NaN,NaN
141955,145540,Khalid Choukoud,1986-03-23,NaN,NaN,NaN,Netherlands,NaN,NaN,NaN
144104,147773,Khalid Al-Ghannam,2000-11-08,Khobar,Ash-Sharqiyah,KSA,Kingdom of Saudi Arabia,171.0,NaN,NaN

In [46]:
bios.loc[bios['name'].str.contains('butt' , case=False)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
3928,3942,Paul Buttimer,1966-07-02,NaN,NaN,NaN,Ireland,165.0,51.0,NaN
13738,13823,Paul Carbutt,1950-07-04,Solihull,England,GBR,Great Britain,175.0,70.0,2004-01-01
19836,19975,Jahangir Butt,1943-04-17,Gujranwala,Punjab,PAK,Pakistan,175.0,70.0,2021-09-07
21944,22100,Harry Butterworth,1867-11-22,Dunedin,Otago,NZL,Great Britain,NaN,NaN,1954-11-30
35499,35777,Jim Butterfield,1950-09-01,Hamilton,Pembroke,BER,Bermuda,168.0,70.0,NaN
41957,42280,John Butt,1850-10-30,South Witham,England,GBR,Great Britain,NaN,NaN,1939-01-01
46464,46812,Serge Buttet,1954-12-14,Romans-sur-Isère,Drôme,FRA,France,NaN,NaN,2021-06-24
54844,55238,Gaston Butter,1888-03-14,Rongy,Hainaut,BEL,Belgium,NaN,NaN,NaN
56056,56454,Abdul Ghani Butt,1939-01-15,Gujranwala,Punjab,PAK,Pakistan,165.0,70.0,NaN
56057,56455,Muhammad Iqbal Butt,1929-12-11,NaN,NaN,NaN,Pakistan,NaN,NaN,NaN
56058,56456,Muhammad Naqi Butt,1919-02-14,NaN,NaN,NaN,Pakistan,NaN,NaN,1990-01-01
57754,58162,Alan Butts,1940-04-11,Birmingham,England,GBR,Great Britain,172.0,79.0,NaN
61623,62075,Carlos Gabutti,1951-08-13,NaN,NaN,NaN,Argentina,NaN,NaN,NaN
68419,68936,George Butterfield,1879-01-01,Stockton-on-Tees,England,GBR,Great Britain,NaN,NaN,1917-09-24
71357,71896,Giuseppe Buttari,1951-02-16,San Felice Circeo,Latina,ITA,Italy,183.0,74.0,NaN
71358,71897,Carlo Butti,1891-09-01,Milano,Milano,ITA,Italy,NaN,NaN,1971-03-14
73864,74434,Sharif Butt,1926-01-15,NaN,NaN,NaN,Pakistan,180.0,68.0,2015-06-08
77594,78185,James Butts,1950-05-09,South Los Angeles,California,USA,United States,188.0,82.0,NaN
80119,80770,Ingrid Butts,1963-07-30,Denver,Colorado,USA,United States,165.0,58.0,NaN
83846,84512,Francesco Butteri,1954-05-09,Civitanova Marche,Macerata,ITA,Italy,189.0,84.0,NaN
83847,84513,Dick Button,1929-07-18,Englewood,New Jersey,USA,United States,NaN,NaN,NaN
85254,85934,George Garbutt,1903-06-18,Winnipeg,Manitoba,CAN,Canada,NaN,NaN,1967-09-21
90241,90964,Stephen Laybutt,1977-09-03,Lithgow,New South Wales,AUS,Australia,189.0,90.0,NaN
92586,93330,Jen Button,1977-10-15,Comox,British Columbia,CAN,Canada,163.0,55.0,NaN
105465,106515,Tyler Butterfield,1983-02-12,Hamilton,Pembroke,BER,Bermuda,182.0,72.0,NaN
107908,109047,Rehan Butt,1980-07-06,Lahore,Punjab,PAK,Pakistan,178.0,65.0,NaN
108953,110130,Jeff Buttle,1982-09-01,Smooth Rock Falls,Ontario,CAN,Canada,173.0,60.0,NaN
110591,111811,Lisa Wallbutton,1986-01-14,Henderson,Auckland,NZL,New Zealand,183.0,85.0,NaN
115996,117373,Buttree Puedpong,1990-10-16,NaN,NaN,NaN,Thailand,157.0,49.0,NaN
121793,123812,Matthew Butturini,1987-08-07,Murwillumbah,New South Wales,AUS,Australia,181.0,81.0,NaN
131411,134198,Linus Butt,1987-03-12,Kempen,Nordrhein-Westfalen,GER,Germany,186.0,83.0,NaN
137961,141343,Alycia Butterworth,1992-10-01,Prince Rupert,British Columbia,CAN,Canada,NaN,NaN,NaN
137969,141351,Lindsey Butterworth,1992-09-27,Burnaby,British Columbia,CAN,Canada,NaN,NaN,NaN
143481,147133,Tynita Butts-Townsend,1990-06-10,Hampton,Virginia,USA,United States,NaN,NaN,NaN

In [49]:
bios.loc[bios['NOC'] == 'pakistan']

Empty DataFrame
Columns: [athlete_id, name, born_date, born_city, born_region, born_country, NOC, height_cm, weight_kg, died_date]
Index: []